"""Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
"""
value = (786, 3.14, "text", True, None)
print(type(value[0]))
print(type(value[1]))
print(type(value[2]))
print(type(value[3]))
print(type(value[4]))
